{"id": "/", "title": "Guidewire Documentation"}
{"id": "/", "title": "Guidewire Documentation"}
{"id": "/cloud/gcp/latest/", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Guidewire Cloud Platform for Developers"}
{"id": "/cloud/gcp/latest/topics/c_new-and-changed.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "New and Changed Guide", "body": "New and Changed Guide"}
{"id": "/cloud/gcp/latest/topics/c_guidewire-cloud-platform.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Cloud Console Guide", "body": ""}
{"id": "/cloud/gcp/latest/index.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Guidewire Cloud Platform for Developers"}
{"id": "/cloud/gcp/latest/topics/t_remove-whitelist-ips.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Removing IP addresses from the whitelist", "body": "Procedure In Cloud Console, navigate to IP Whitelisting . In the IP Range Whitelist table, hover over the IP range you want to remove from the whitelist and click the trash can icon."}
{"id": "/cloud/gcp/latest/topics/c_new-and-changed-24-02-2020.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "New and Changed in Cloud Console 24/02/2020", "body": "Removed the Limit On the Number of Environments You can have more than 10 environments. Provisioning environments Enabled Switching Between Projects You can now switch between projects in Cloud Console. Accessing projects"}
{"id": "/cloud/gcp/latest/topics/c_new-and-changed-09-01-2020.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "New and Changed in Cloud Console 09/01/2020", "body": "Enabled Cloud Data Access (CDA) with Guidewire Cloud Platform This change enables CDA to capture ClaimCenter data from all environments and make it available via S3 buckets. Note: You cannot drop the database on environments connected to CDA. Sumo Logic Kubernetes Log Querying This update includes a new and improved way of ingesting Kubernetes logs into Sumo Logic, which enriches logs with metadata like cluster, namespace, deployment, pod, and more. In your log queries, instead of specifying fields like _source and _sourceCategory , you can now use the cluster , namespace , deployment , and pod fields. SumoLogic indexes Kubernetes resources logs with their respective native names, which simplifies the querying process. The following resources can be queried direct on SumoLogic: Deployment Pod Namespace Cluster For example, to get logs of a ClaimCenter deployment in the namespace devsat , use the following: namespace = devsat and deployment = cc"}
{"id": "/cloud/gcp/latest/topics/c_new-and-changed-31-01-2020.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "New and Changed in Cloud Console 31/01/2020", "body": "Enabled Undeploying Applications You can now undeploy all applications in an environment. Undeploying applications Enabled Deleting Environments You can now delete environments. Deleting environments New Way of Accessing Logs This change introduces a new way of accessing application logs. To view logs, click the Application Logs link in the Environments tab. Querying logs"}
{"id": "/cloud/gcp/latest/topics/t_filter-logs.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Querying logs", "body": "You can access logs for deployed applications from Guidewire Cloud Console. In Sumo Logic, you can view logs for a specific deployed application. About this task View logs for a specific application. Procedure In Cloud Console, navigate to Environments . Click Application Logs . You will be redirected to Sumo Logic. In Sumo Logic, click Library > Search application logs in the left-hand panel. In Parameters , enter the name of the application for which you want to view the logs."}
{"id": "/cloud/gcp/latest/topics/c_whitelisting-ips.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Whitelisting IP addresses", "body": "With Guidewire Cloud, only selected IP ranges have access to deployed applications, Bitbucket and TeamCity. By default, the cluster cannot be accessed from the Internet. To enable access, whitelist IP ranges in Guidewire Cloud Console. To enable access, an administrator must whitelist IP ranges in Guidewire Cloud Console."}
{"id": "/cloud/gcp/latest/topics/c_accessing-deployed-applications.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Accessing deployed applications", "body": "You can access a deployed application from Guidewire Cloud Console. In the Environments tab, expand the environment with the deployed application and click the link under the application name."}
{"id": "/cloud/gcp/latest/topics/t_deploy-build-manual.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Deploying builds", "body": "You can manually deploy a build. Procedure In Cloud Console, navigate to Environments . Expand the environment to which you want to deploy the build. Click New Deployment . For each application, select the branch and the build you want to deploy. Optionally, provide environment variables. Optionally, select Drop Database . Do not select this option for environments connected to Cloud Data Access. Click Deploy ."}
{"id": "/cloud/gcp/latest/topics/c_accessing-teamcity.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Accessing TeamCity", "body": "You access TeamCity from Guidewire Cloud Console. In the Environments tab, click the Build Management link."}
{"id": "/cloud/gcp/latest/topics/c_projects.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Accessing projects", "body": "To access a project from Guidewire Cloud Console, select it from the drop-down at the top of the application screen."}
{"id": "/cloud/gcp/latest/topics/t_clear-deployment.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Undeploying applications", "body": "You can undeploy all applications in an environment. Procedure In Cloud Console, navigate to Environments . Expand the environment you want to clear. Click Clear and confirm."}
{"id": "/cloud/gcp/latest/topics/t_accessing-bitbucket.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Accessing Bitbucket", "body": "About this task You access Bitbucket from Guidewire Cloud Console. Procedure In the Environments tab, click the Source Code link. Find the project you want to work on. You can find the name of the project in Cloud Console, in the drop-down at the top of the application screen."}
{"id": "/cloud/gcp/latest/topics/c_provisioning-environments.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Provisioning environments", "body": "If you need additional application environments, initiate a request with your customer partner. If you need additional application environments, initiate a request with Guidewire Cloud Operations. You can add new environments using Guidewire Cloud Console."}
{"id": "/cloud/gcp/latest/topics/c_developer-workstation-setup.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Developer workstation", "body": "In addition to a standard InsuranceSuite application environment, a developer workstation must include the following: Git version 2.24.0 or later Git Large File Storage (LFS) extension: https://git-lfs.github.com/ Java 11: https://docs.aws.amazon.com/corretto/latest/corretto-11-ug/downloads-list.html Note: InsuranceSuite Cloud development requires a cloud-based application database."}
{"id": "/cloud/gcp/latest/topics/c_initial-provisioning.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Initial provisioning", "body": "As a Guidewire Cloud InsuranceSuite customer, you get access to a full Continuous Integration/Continuous Deployment (CI/CD) pipeline and code repository. During initial provisioning, Guidewire Cloud Operations provide the following: A preconfigured, highly available and highly reliable environment deployed in a scalable, clustered space. A development instance of base InsuranceSuite code in Atlassian Bitbucket. All configuration and integration work begins with this development instance and is the responsibility of your company. Guidewire Cloud Operations do not apply any configurations or integrations to the base code. A preconfigured, cloud-based database cluster per environment. The cluster contains databases for each application within the environment. A CI/CD automation environment based on Guidewire Cloud Console. A build management infrastructure in TeamCity."}
{"id": "/cloud/gcp/latest/topics/legal-notice.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Legal notice", "body": "© 2019 Guidewire Software, Inc. For information about Guidewire trademarks, visit http://guidewire.com/legal-notices . Guidewire Proprietary & Confidential — DO NOT DISTRIBUTE"}
{"id": "/cloud/gcp/latest/topics/t_whitelist-ips.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Adding IP addresses to the whitelist", "body": "Procedure In Cloud Console, navigate to IP Whitelisting . In IP Range to add , enter the IP address you want to whitelist. Use the CIDR format. Provide a description for the entry. To whitelist several IP addresses at once, click + and enter the IP addresses. Click Add to Whitelist . Whitelisted entries appear in the IP Range Whitelist table."}
{"id": "/cloud/gcp/latest/topics/t_delete-environment.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Deleting environments", "body": "You can delete an environment when you no longer need it. Procedure In Cloud Console, navigate to Environments . Expand the environment you want to delete. Click Delete and confirm."}
{"id": "/cloud/gcp/latest/topics/t_add-environment.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Adding environments", "body": "Procedure In Cloud Console, navigate to Environments . Click New Environment . Provide a name for the new environment and click Save . The name must consist only of lower-case letters and digits. The name must be 253 characters or less."}
{"id": "/cloud/gcp/latest/topics/t_set-up-developer-workstation.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Setting up the developer workstation", "body": "Procedure Install Git. Install the Git Large File Storage extension. Enable long path support. git config --global core.longpaths true Install the JDK. Set the %JAVA_HOME environment variable to the JDK installation directory. Generate a SSH key. Add the SSH key to the project you want to work on and clone the project. Navigate to the directory with the project. Run Studio. ./gwb studio"}
{"id": "/cloud/gcp/latest/topics/c_provisioning-cloud-console.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Guidewire Cloud Console", "body": "Guidewire Cloud Console (GCC) is a one-stop control center for Guidewire Cloud. As a developer, you can use GCC to deploy Guidewire applications. You can also access Bitbucket and Teamcity from GCC. As an administrator, you can use GCC to provision new environments and grant access to Guidewire Cloud."}
{"id": "/cloud/gcp/latest/topics/c_provisioning-bitbucket.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Bitbucket", "body": "Guidewire provides a predetermined number of Bitbucket licenses. The number of licenses is based on the number of developers allocated to cloud projects in your company. Bitbucket plugins Guidewire Cloud Operations do not preconfigure any Bitbucket plugins. You can request plugins from a list of supported plugins maintained by Guidewire Cloud Operations. Plugins not on the list can be submitted for consideration through a Guidewire Community case or a JIRA ticket."}
{"id": "/cloud/gcp/latest/topics/c_bitbucket-repository.html", "platform": "cloud", "product": "Guidewire Cloud Platform", "version": "latest", "title": "Bitbucket repository", "body": "As a part of the initial CI/CD environment provisioning, Guidewire creates a single Bitbucket repository. The base version number of each product is included in the repository name."}
